Code for creating and using a SQL database in Python. We will use pandas, sqlalchemy, and sqlite

References:

* https://towardsdatascience.com/sqlalchemy-python-tutorial-79a577141a91
* https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_sql.html
* https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.to_sql.html

In [3]:
from sqlalchemy import create_engine
import pandas as pd

# Create local in-memory SQL database using sqlite
# Note that you could also create this database in a .db file if desired
engine = create_engine('sqlite://', echo=False)
 
# Create some sample data 
df = pd.DataFrame({'name' : ['User 1', 'User 2', 'User 3']})
 
# Put the sample data in the database
df.to_sql('users', con=engine,index=False)

In [4]:
# Examine our database
pd.read_sql("select * from users",engine)

     name
0  User 1
1  User 2
2  User 3

In [6]:
df1 = pd.DataFrame({'name' : ['User 8', 'User 9', 'User 10']}) # create more data

# Append our extra data into the database
df1.to_sql('users', con=engine,index=False,if_exists='append')

In [7]:
# Re-examine our database
pd.read_sql("select * from users",engine)

      name
0   User 1
1   User 2
2   User 3
3   User 8
4   User 9
5  User 10